// 2023/08/04
// 書籍名：リーンスタートアップ


// この本を読む理由

// DIG推薦書籍。
// リーンスタートアップとは何か。トヨタ生産方式とのつながり。アジャイル開発。MVP。ピボットの理解を深める
// チームでのプロダクト開発に生かす


// アントレプレナー
// ゼロから会社や事業を創り出す人の事
// 例）起業家


// ステークホルダー
// 企業活動で影響を受けるすべての相手の事
// 例）クライアント、従業員、株主、地域社会、行政機関、金融機関、各種団体、政府など


// イノベーター理論
// 消費者を価値観や行動によって5つのタイプに分類し、新しい商品やサービスが市場に普及していく流れを分析した理論の事
// 1.イノベーター[革新者](2.5%)
// 2.アーリーアダプター[初期採用者](13.5%)
// 3.アーリーマジョリティ[前期追随者](34%)
// 4.レイトマジョリティ[後期追随者](34%)
// 5.ラガード[遅滞者](16%)


// アーリーアダプター
// 流行に敏感で、自ら情報収集を行い判断する層の事。=> 製品をもっとも強く欲している顧客


// イノベーター
// 新製品やアイデアを周囲の人に影響されず、自ら進んで採用する消費者・企業の事


// リーン生産方式
// トヨタ生産方式を一般向けに体系化したもの
// プロセス管理を徹底して効率化することで、従来の大量生産方式と同等以上の品質を実現しながらも
// 作業時間や在庫量が大量に削減できる生産方式。
// ジャストインタイムの製造・在庫管理、サイクルタイムの短縮など


// リーン・スタートアップ
// 画期的な新製品を開発していく企業方法、製品開発マネジメント方法。
// 利点：低コストかつ短期間で必要最低限の機能をもった製品を作った後に顧客に使ってもらって検証し、学びを得る。
// このサイクルを繰り返す事で画期的な新製品を開発する事が出来る。


// ベンチャーキャピタル
// 未上場のベンチャー企業に出資して株式を取得し、将来的に企業が上場した際に、
// 株式を売却して利益を獲得する投資会社・投資ファンドの事

// セクター
// 株式相場や株式市場を分析する際に、区分するグループの事。

// 構築-計測-学習

// マネジメントパラダイム
// マネジメント：管理・経営
// パラダイム：特定の時代・分野において支配的な規範となる物の見方や捉え方の事。規範的な考え方は時代の変化につれて革命的・非連続的な変化を起こす場合が有る。


// 検証による学び


// トレードオフ
// 両立できない関係性。

// インフラストラクチャー
// 産業や生活の基盤となる社会基本。

// 成長のエンジン(engine of growth)
// スタートアップが持続的に成長するために必要とするメカニズム。

// 構築-計測-学習
// 顧客の共感を構築し、その反応を測定して、顧客とのやり取りを向上させる
// ために加えるべき調整を学習するためのプロセスについての説明。

// ピボット(方向転換)
// スタートアップ企業が成長を目指して、これまで取り組んできた事業から
// 他の事業へ転換すること。

// 辛抱(persevere)

// ビジョン(vison)

// 戦略(strategy)

// エンジンのチューニング
// 製品の最適化のプロセス。

// イントレプレナー(企業内起業家)
// 社内起業家のこと。

// ゼネラルマネージャー
// 組織の統括。

// ビジョナリー
// 先見の明のある人。事業の将来を見通した展望を持っている人。

// スタートアップ
// とてつもなく不確実な状態で新しい製品やサービスを創り出さなければならない人的組織

// 持続的イノベーション
// 顧客の満足のために、現在すでに存在している製品に起こす革新のこと。

// 破壊的イノベーション
// 既存の市場で求められる価値を低下させつつ、新しい価値基準を市場にもたらす
// イノベーションのこと。

// アナリスト
// 国や企業の動向を分析する専門家のこと。

// 戦略的思考
// 何を誰の為に作るのか
// どの市場ならいまから参入して支配的立場になれるか
// 競争で蝕まれることのなり永続的な価値をどうしたら作れるのか

// 2023/08/08

// ホッケースティック曲線
// 急成長スタートアップ企業やR&D投資を主とする企業が描く収益曲線

// IMVU

// 検証すべき事。検証して学びを得る
// この製品は作るべきか
// このような製品やサービスを中心に持続可能な事業が構築できるか


// 価値仮設
// 顧客が製品やサービスを使うようになったとき、本当に価値を提供できるかどうかを判断するもの

// 成長仮設
// 製品やサービスが顧客から新しい顧客へと伝播(でんぱ)していくかどうかを判断するもの
// 伝播（伝わり広がっていくこと。広い範囲に伝わる事）

// アーリーアダプターを見るける事が重要
// なぜか。失敗に寛容。フィードバックも返してくれることも多いから。

// MVP(コンシェルジュ型実用最小限の製品)

// プロダクト開発チームに行う4つの問い
// 1.我々が解決しようとしている問題に消費者は気づいているか？
// 2.解決策があれば消費者はそれを買うか？
// 3.我々から買ってくれるか？
// 4.その問題の解決策を我々は用意できるか？


// モノを作る前にまずリスクと仮説を洗い出してその仮説を実験で検証する

// 機能不足という苦情は、チームが正しい道を進んでいる証拠
// 反対にロードマップに書かれているが顧客から苦情が来なかった機能は重要ではない

// 成功とは機能を提供することではない。
// 成功とは、顧客の問題をどうしたら解決できるのか学ぶこと


// 2023/08/09


// ケースワーカー
// 生活する上での困りごとを抱えている人の相談を受ける仕事。

// 計画とは長期的にわたり安定した運用実績があってはじめて効果を発揮するツール

// スタートアップが生み出す製品の実態は実験であり、その実験から得られる成果は
// どうすれば持続可能な事業が構築できるのかという学びである。

// 学び>>>お金、賞、メディア露出

// 構築-計測-学習のフィードバックループ
// アイデア→構築→製品(MVP)→計測→データ→学ぶ→アイデア.......
// 舵取りの肝: ループに要するトータルの時間を最小にする


// 挑戦の要
// 計画でもっともリスクが高い要素、ほかのすべてを支える基礎となっている部分。特に価値仮説＆成長仮説が大事

// 革新会計(イノベーションアカウンティング)
// 売上やコンバージョンなどの数字の変化は、本当に製品の改良によるものなのか、
// 本当に前進しているのかを把握できる計測方法

// 学びの中間目標

// 行動につながる評価基準
// 実務的なメリット有り

// 虚栄の評価基準
// 危険

// ピボット(方向転換)
// 構築-計測-学習のループ後に、方向転換するか維持するか

// アクティブユーザーがサイトで過ごす時間 = 製品価値
// 普及速度 =>広がり

// ブローカー
// 株式や債券などの有価証券の売買取引を仲介する人、もしくは機関のこと。

// 考えるだけでは答えは得られない。
// うまくいかない反証がいくつも出せてしまうから


// 戦略の策定
// 類例・反例

// 成功と失敗を分ける鍵は、計画のうまくいっている部分と道を誤っている部分をみつけられるだけの
// 先見性と能力、ツールをアントレプレナーが持っていて、戦略を状況に順応させられるかどうか。


// 2023/08/10
// P114～

// 顧客の原型
// ターゲットとする顧客の人間性を記した文書
// 顧客というのは自分たちが何を望んでいるのかよくわかっていないもの

// MVPは事業仮説を検証するためのもの

// アーリーアダプターは製品に欠けている部分を想像力で補う

// アーリーアダプターが求める以上に機能を増やしたり完成度を高めたりするのは、ムダ

// 作りこみすぎたり約束しすぎたりという衝動をいかに抑えるかがポイント


// 動画型MVP
// ものによってはMVPを作るのに技術的な問題が多くあり、解決しないと製品が動かない=>何年も掛けないと製品にならない
// 時間を費やして作ってもニーズがズレていたら、無駄になってしまう。どうすればいいか動画を作って動きを見てもらう
// アーリーアダプターに


// コンシェルジュ型MVP
// 現実の顧客で成長モデルを体系的に検証する
// 成長モデルを支える要の仮説を検証する学び
// 手動の問題から顧客を増やすのが難しくなったとき、初めて処理の自動化の為に製品開発をする




// 2023/08/11

// P133~

// 低品質なMVPであっても高品質の製品を作るのに役立つ
// 誰が顧客なのか分からなければ、何が品質なのかも分からない。


// 時には安直な妥協の産物の方が、時間やお金を掛けて作った機能よりも高評価を得られる事もある

// MVPは仮説検証に勇気が必要
// 良い反応の場合：仮説は正しい、悪い反応の場合：製品の改良が必要だと確認が出来た

// 重要★顧客と開発者の評価が違っていないか。

// MVPを作るときのルール
// 求める学びに直接貢献しない機能やプロセス、労力はすべて取り除く

// MVPを作るときのリスク
// 法的問題、競合他社に対する恐れ、ブランディングのリスク、意欲

// MVPでどのような結果が出ても絶対に希望は捨てないと最初に決めておく


// 成長速度を左右するポイント
// 1.顧客ごとの利益率
// 2.新規顧客の獲得コスト
// 3.既存顧客の購入リピート率


// 革新会計　学びの中間目標
// 1.MVPから会社のデータ得て現状を正しく認識する
// 2.ベースライン状態から理想状態へエンジンのチューニングを行う
// 3.方向転換するか辛抱するか選択する

// エンジンのチューニング
// スタートアップ企業には成長モデルの原動力の強化が必要
// 原動力=>新規顧客のアクティベーション率


// コホート分析

// 虚栄の評価基準
// 行動につながる評価基準





// 2023/08/14

// P169～

// スプリント

// ユーザーストーリー

// エクストリームプログラミング

// プロダクトバックログ

// 変化していく事業側のニーズに製品を対応させるのがエンジニアの仕事．
// 事業に関する決定が正しいか否かにエンジニアは関与しない．

// システム理論
// システムの一部を最適化するとシステム全体が劣化する

// スプリットテスト（A/Bテスト）
// 異なるバージョンの製品を同時並行で顧客に提供する実験．




// 2023/08/21


// P178~


// 3つのしやすさ
// 行動しやすさ、わかりやすさ、チェックしやすさ

// 学びの評価尺度はコホート分析が最適
// コホート分析とは
// この期間に製品を利用した人のうち、注目する各種の行動をとった人数は行動ごとに以下のとおりである





























